package com.example.retry;

public class QuestionAnsuer {
    public static String question [] ={

            "Люди вашего пола привлекают вас как сексуальный объект?",
            "В последнее время у вас бывали фантазии о сексуальной близости с каким-то конкретным человеком вашего пола?",
            "Есть ли в ваших мечтах пункт о сексуальной встрече с представителем вашего пола?",
            "Возбуждают ли вас видео с сексуальной связью людей вашего пола друг с другом?",
            "В последнее время у вас происходили прямые или косвенные сексуальные контакты с представителями вашего пола, от которых вы испытывали удовольствие?",
            "Случалось ли в вашей жизни, что вы хотели бы состоять в сексуальных отношениях с представителем вашего пола?",
            "Часто ли в вашей жизни вы отмечаете, что к вам приходят образы и фантазии о сексуальных отношениях с представителем вашего пола?",
            "Случалось ли, что вы думали или представляли когда-либо, что любовные отношения с представителем вашего пола вполне могли бы быть гармоничными?",
            "Можно ли утверждать, что вы испытываете агрессию и неприятие по отношению к гомосексуалам - представителям вашего пола?",
            "Можно ли утверждать, что вы считаете себя представителем противоположного пола?",
            "Случаются ли в вашей жизни сексуальные контакты с представителями противоположного пола, которые приносят вам удовольствие?",
            " Случалось ли вам испытывать сексуальное влечение к представителям противоположного пола?",
            "Можно ли утверждать, что представители противоположного пола привлекают вас сексуально?",
            "Случалось ли в вашей жизни, что вы мечтали о человеке противоположного пола и сексуальной встрече с ним?",
            "Случалось ли такое, что у вас возникали фантазии о встрече с человеком противоположного пола с сексуальным содержанием?",
            "Возбуждают ли вас видео с сексуальной связью людей противоположного пола друг с другом?",
            "Состояли ли вы в сексуальных отношениях, от которых вы испытывали удовольствие, с человеком противоположного пола?",
            "Можно ли утверждать, что вам хотелось бы сексуальных отношений с представителем противоположного пола?",
            "Случалось ли вам испытывать сексуальные фантазии или мечтать о сексуальных отношениях с человеком противоположного пола?",
            "Можно ли утверждать, что вы состоите в сексуальных контактах с представителем/ми противоположного пола?",
            "Можно ли утверждать, что вы ощущаете или представляете гармонию в любовных отношениях с представителями противоположного пола?",
            "Можно ли утверждать, что вы терпимо относитесь к выбору человека в плане сексуальной ориентации?",
            "Можно ли утверждать, что вы идентифицируете себя с представителями своего пола?"


    };
    public static String choices[][] ={

            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"},
            {"Точно нет","Точно да","Скорее нет","Скорее да"}

    };
    public static String correctAnswer [] ={

            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно нет",
            "Точно да",
            "Точно да",
            "Точно да",
            "Точно да",
            "Точно да",
            "Точно да",
            "Точно нет",
            "Скорее да",
            "Точно да",
            "Точно да"




    };
}

